---
title : "02. pandas"
author : "gc"
date : "04/14/24"
---

# Intro

`-` numpy를 이용해서 만들어진 모듈

`-` 데이터를 읽고, 쓰고, 저장하고 시각화하는 기능이 포함되어 있음

`-` 표 형식의 데이터(데이터프레임)를 다루는데 필수적인 모듈!

`-` numpy와 달리 다양한 자료형을 표 형식으로 저장할 수 있음!($\star\star$)

# DataFrame 생성

## 1. 리스트

In [6]:
import pandas as pd
import numpy as np

In [4]:
l = [["a", 50, 86], ["b", 89, 31], ["ikjoong", 68, 91]]

pd.DataFrame(l)

         0   1   2
0        a  50  86
1        b  89  31
2  ikjoong  68  91

## 2. numpy

In [7]:
pd.DataFrame(np.array(l))

         0   1   2
0        a  50  86
1        b  89  31
2  ikjoong  68  91

## 3. Series

In [12]:
l2 = [
    pd.Series(["a", 50, 86]),
    pd.Series(["b", 89, 31]),
    pd.Series(["c", 68, 91]),
        
]

pd.DataFrame(l2)

   0   1   2
0  a  50  86
1  b  89  31
2  c  68  91

## 4. Dictionary

In [20]:
dic = {"name" : ["a","b","c"],
       "s1" : [50,89,68],
       "s2" : [86,31,91]}

df = pd.DataFrame(dic)
df

  name  s1  s2
0    a  50  86
1    b  89  31
2    c  68  91

In [21]:
df.set_index("name")

      s1  s2
name
a     50  86
b     89  31
c     68  91